<template>
    <div 
        class="app__main help d-flex"
        :class="user ? 'flex-row' : 'flex-column'"
    >
        <SideBar
            v-if="user"
        />

        <div 
            class="app__block py-5"
            :class="user ? '' : 'm--width-100'"
        >
            <h1 class="h3 text-primary text-uppercase mb-4">Условия оплаты</h1>
            <b-card
                bg-variant="primary-light"
                border-variant="primary"
                class="home__block p-1 mb-5"
            >
                <b-card-text>
                    <h4 class="text-primary"><strong>Зачем мне личный кабинет?</strong></h4>
                    <p>В ЛИЧНОМ КАБИНЕТЕ Вы можете оплатить % и сумму займа даже если под рукой нет номера залогового билета, а также узнать ВСЮ информацию о своих залоговых билетах (действующих и погашенных):</p>
                    <ul>
                        <li>№ залогового билета</li>
                        <li>Сумма займа</li>
                        <li>Дата оформления</li>
                        <li>Дата возврата займа (после этой даты у Вас есть 30 дней льготного месячного срока, который предоставлен любому клиенту ломбарда Законом о ломбардах)</li>
                        <li>Срок хранения имущества в ломбарде (после окончания срока займа, а также после завершения льготного месяца наша компания хранит залоговую вещь ещё минимум 12 дней, а то и дольше – это зависит от даты выхода на аукцион)</li>
                        <li>Дата последней оплаты %</li>
                        <li>Статус залогового имущества (в ломбарде, выкуплено залогодателем, отправлено на склад, реализовано)</li>
                        <li>Предмет залога (описание)</li>
                        <li>Рассчитать % за нужный период</li>
                        <li>График начисления % на каждый день займа (дата, сумма, процентная ставка)</li>
                        <li>Возможность написать в службу поддержки и получить срочный ответ (в приоритетной очередности)</li>
                    </ul>
                </b-card-text>
            </b-card>
            <b-card
                bg-variant="success-light"
                border-variant="success"
                class="home__block p-1 mb-5"
            >
                <b-card-text>
                    <h4 class="text-success"><strong>Как зарегистрироваться?</strong></h4>
                    <p>Зарегистрироваться может тот, кто хотя бы раз пользовался нашими услугами и указал свой телефонный номер в одном из отделений "Фианит-Ломбарда" (подтвердил его товароведу или оператору колл-центра через код, пришедший по смс). Важно, чтобы телефон был актуальный!</p>
                    <ul>
                        <li>Нажмите «Зарегистрироваться»</li>
                        <li>Укажите серию/номер паспорта и номер телефона (который Вы сообщали товароведу в ломбарде!). Нажмите «Отправить код». Вам поступит СМС с кодом.</li>
                        <li>Код из СМС введите в соответствующее поле.</li>
                        <li>Введите и сохраните свой пароль</li>
                        <li>Поздравляем! Возможности Личного кабинета – в Вашем распоряжении.</li>
                    </ul>
                </b-card-text>
            </b-card>
            <b-card
                bg-variant="warning-light"
                border-variant="warning"
                class="home__block p-1 mb-5"
            >
                <b-card-text>
                    <h4 class="text-warning"><strong>Если не удается зарегистрироватсья или войти</strong></h4>
                    <p><strong>Не вводятся цифры или другие символы при регистрации. </strong><br>
                    Попробуйте зайти на страницу с другого браузера,<br>
                    либо перезагрузите страницу (нажав на клавиатуре одновременно Ctrl + F5),<br>
                    либо попробуйте зайти на страницу в режиме "Инкогнито" (нажав на клавиатуре одновременно Ctrl + Shift + N).</p>

                    <p><strong>Вы ввели номер телефона и нажали «Отправить код», но на экране появилась надпись: «Клиент не найден по переданным параметрам».</strong><br>
                    Убедитесь, что Вы ввели именно тот номер, который сообщали товароведу в ломбарде. Возможно, ранее в ломбарде Вы не подтвердили этот номер кодом из СМС, поэтому телефон не отображается в нашей базе данных. Тогда в верхнем меню сайта нажмите «Подтвердить тел.номер» (заполните поля, Вам придёт код из смс, который нужно ввести). Либо позвоните в наш колл-центр 88003331220 с номера, который сообщали товароведу в ломбарде, и попросите оператора подтвердить (верифицировать) Ваш номер.</p>

                    <p><strong>Не поступило смс.</strong><br>
                    Убедитесь, что ввели верный номер, попробуйте еще раз.</p>

                    <p><strong>Не сохраняется пароль.</strong><br>
                    Проверьте пароль - он должен состоять как минимум из 4 символов (букв и/или цифр).<br>
                    Не используйте спецсимволы (знаки препинания, символы =, +, @, %,  $ и т.д.) при создании пароля.</p>

                    <p><strong>Если Вы забыли пароль.</strong><br>
                    Не беспокойтесь: чтобы завести новый пароль, просто пройдите заново регистрацию (введите серию и номер паспорта, номер телефона, код из смс).</p>
                </b-card-text>
            </b-card>
        </div>
    </div>
</template>

<script>
    import SideBar from '@/components/side-bar';
    export default {
        name: 'help',
        components: {
            SideBar
        },
        props: {
        },
        data() {
            return {
                user: this.$store.state.user
            };
        },
        computed: {
        },
        created() {
        },
        methods: {
        }
    };
</script>
